package HW;

public class HW_1_1 {
    public static void main(String[] args) {
//        Написать программу которая будет печатать/выводить следующий текст:
//
//        3
//        2
//        1
//        Поехали!!!
        System.out.println("3");
        System.out.println("2");
        System.out.println("1");
        System.out.println(" Поехали!!!");

    }
}
